app/Controllers/Photos.php

    public function index()
    {
        $photoModel = new \App\Models\PhotoModel();

        $data['photos'] = $photoModel->orderBy('taken_at', 'DESC')->findAll();

        // Calculate total storage
        $totalBytes = $photoModel->selectSum('size')->first()['size'] ?? 0;
---
SELECT *
FROM `photos`
ORDER BY `taken_at` DESC
SELECT SUM(`size`) AS `size`
FROM `photos`
 LIMIT 1

    public function upload()
    {
        $file = $this->request->getFile('file');

        if ($file === null || !$file->isValid()) {
            return $this->response->setJSON(['status' => 'error', 'message' => $file ? $file->getErrorString() : 'No file uploaded']);
        }

        $newName = $file->getRandomName();
        $file->move(FCPATH . 'uploads', $newName);

        $photoModel = new \App\Models\PhotoModel();
        $fullPath = FCPATH . 'uploads/' . $newName;
        $thumbnailPath = FCPATH . 'thumbnails/' . $newName;

        $imageInfo = getimagesize($fullPath);

        $data = [
            'filename'       => $newName,
            'path'           => 'uploads/' . $newName,
            'mime_type'      => $imageInfo['mime'] ?? '',
            'width'          => $imageInfo[0] ?? null,
            'height'         => $imageInfo[1] ?? null,
            'size'           => filesize($fullPath),
            'taken_at'       => $this->getExifDate($fullPath) ?: date('Y-m-d H:i:s'),
            'thumbnail_path' => 'thumbnails/' . $newName,
        ];

        $this->generateThumbnail($fullPath, $thumbnailPath);
        $photoModel->insert($data);
---
INSERT INTO `photos` (`filename`, `path`, `mime_type`, `width`, `height`, `size`, `taken_at`, `thumbnail_path`, `created_at`, `updated_at`) VALUES ('1771618716_fbced523ffa55b01dc24.jpg', 'uploads/1771618716_fbced523ffa55b01dc24.jpg', 'image/jpeg', 4608, 3456, 7732751, '2024-01-20 15:00:51', 'thumbnails/1771618716_fbced523ffa55b01dc24.jpg', '2026-02-20 20:18:37', '2026-02-20 20:18:37')